html/20231128T130520--ivy-new-file-creation-completion-candidates-bug__emacs.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/devnotes/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/devnotes/html">
<title>ivy new file creation completion candidates bug</title>
<meta name="author" content="Arvydas Gasparavicius">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
<link rel="stylesheet" href="../static/style.css"/>
<link rel="icon" href="../static/ag.ico">
</head>
<body>
<div id="preamble" class="status"><br>preamble here yo</br></div>
<div id="content">
<div class="post-date">15 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/devnotes/html/20231128T130520--ivy-new-file-creation-completion-candidates-bug__emacs.html">ivy new file creation completion candidates bug</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgdc4a521">1. ivy new file creation completion candidates bug</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgdc4a521" class="outline-2">
<h2 id="orgdc4a521"><span class="section-number-2">1.</span> ivy new file creation completion candidates bug</h2>
<div class="outline-text-2" id="text-1">
<p>
In Emacs with Ivy, when you try to create a new file with a name that partially
matches an existing file, Ivy will prioritize the existing file as a completion
candidate. If you want to create a new file with a similar name, you can use
the following workaround:
</p>

<p>
Start typing the name of the new file you want to create, for example, "api".
</p>

<p>
When Ivy presents the completion options and highlights the existing file
"lifeapi", press the C-M-j key combination (which stands for
ivy-immediate-done). This key combination allows you to bypass the completion
and directly accept the current input as the selected option.
</p>

<p>
After pressing C-M-j, Ivy will accept the current input and create a new file
with the name you specified ("api" in this case), instead of choosing the
existing "lifeapi" file.
</p>

<p>
By using C-M-j, you can bypass the completion and proceed with creating the new
file with the desired name, even if it partially matches an existing file.
</p>

<p>
Note: The keybinding C-M-j is the default binding for ivy-immediate-done, but
it may vary depending on your Emacs configuration. If C-M-j doesn't work for
you, you can check your Ivy keybindings or customize the keybinding for
ivy-immediate-done in your Emacs configuration.
</p>
</div>
</div>
<div class="taglist"><a href="https://arvydasg.github.io/devnotes/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/devnotes/html/tag-emacs.html">emacs</a> </div></div>
<div id="postamble" class="status"><br>postamble in he house</br></div>
</body>
</html>
